NordicSemiconductor/nrfx/mdk/nrf54h20_enga_ppr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210_NS">
      <name>GLOBAL_ATBFUNNEL211_NS</name>
      <description>ATB funnel module 1</description>
      <baseAddress>0xBF04D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210_NS">
      <name>GLOBAL_ATBFUNNEL212_NS</name>
      <description>ATB funnel module 2</description>
      <baseAddress>0xBF04E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210_NS">
      <name>GLOBAL_ATBFUNNEL213_NS</name>
      <description>ATB funnel module 3</description>
      <baseAddress>0xBF04F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral>
      <name>VPRCLIC_NS</name>
      <description>VPR CLIC registers 0</description>
      <baseAddress>0x4F909000</baseAddress>
      <headerStructName>CLIC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x3000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VPRCLIC_0</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_1</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_2</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_3</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_4</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_5</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_6</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_7</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_8</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_9</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_10</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_11</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_12</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_13</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_14</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>VPRCLIC_15</name>
        <value>15</value>
      </interrupt>
      <groupName>CLIC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>CLIC</name>
          <description>Unspecified</description>
          <headerStructName>CLIC_CLIC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>CLICCFG</name>
            <description>CLIC configuration.</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000005</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NVBITS</name>
                <description>Selective interrupt hardware vectoring.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Implemented</name>
                    <description>Selective interrupt hardware vectoring is implemented</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NLBITS</name>
                <description>Interrupt level encoding.</description>
                <lsb>1</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Two</name>
                    <description>2 bits = 3 interrupt levels</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NMBITS</name>
                <description>Interrupt privilege mode.</description>
                <lsb>5</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ModeM</name>
                    <description>All interrupts are M-mode only</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLICINFO</name>
            <description>CLIC information.</description>
            <addressOffset>0x0004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00001FFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMINTERRUPTS</name>
                <description>Maximum number of interrupts supported.</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>VERSION</name>
                <description>Version</description>
                <lsb>13</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>NUMTRIGGER</name>
                <description>Number of maximum interrupt triggers supported</description>
                <lsb>25</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1E0</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CLICINT[%s]</name>
            <description>Description collection: Interrupt control register for IRQ number [n].</description>
            <addressOffset>0x1000</addressOffset>
            <access>read-write</access>
            <resetValue>0x3FC3FEFE</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IP</name>
                <description>Interrupt Pending bit.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPending</name>
                    <description>Interrupt not pending</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pending</name>
                    <description>Interrupt pending</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ1</name>
                <description>Read as 1, write ignored.</description>
                <lsb>1</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IE</name>
                <description>Interrupt enable bit.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Interrupt disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Interrupt enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ2</name>
                <description>Read as 1, write ignored.</description>
                <lsb>9</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SHV</name>
                <description>Selective Hardware Vectoring.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Vectored</name>
                    <description>Hardware vectored</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRIG</name>
                <description>Trigger type and polarity for each interrupt input.</description>
                <lsb>17</lsb>
                <msb>18</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EdgeTriggered</name>
                    <description>Interrupts are edge-triggered</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>Privilege mode.</description>
                <lsb>22</lsb>
                <msb>23</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MachineMode</name>
                    <description>Machine mode</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRIORITY</name>
                <description>Interrupt priority level</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PRIOLEVEL0</name>
                    <description>Priority level 0</description>
                    <value>0x3F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PRIOLEVEL1</name>
                    <description>Priority level 1</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PRIOLEVEL2</name>
                    <description>Priority level 2</description>
                    <value>0xBF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PRIOLEVEL3</name>
                    <description>Priority level 3</description>
                    <value>0xFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
